name: "decoder"
backend: "python"
max_batch_size: 0

input [
  {
    name: "output_ids"
    data_type: TYPE_INT64
    dims: [-1]
  }
]

output [
  {
    name: "TEXT_OUT"
    data_type: TYPE_STRING
    dims: [-1]
  }
]


instance_group [
  {
    kind: KIND_CPU
  }
]